Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 1s [id=222634395437]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.appcd_2d98cbf0-d17b-46e8-922c-a2d188b1f846.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "aws_s3-hello-kitty-policy"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "vaivaswat_manu"
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_iam_policy_document.website_bucket_policy[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "website_bucket_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0] will be created
  + resource "aws_kms_alias" "a" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/s3-vaivaswat_manu"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0] will be created
  + resource "aws_kms_key" "custom_s3_kms_key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "Custom KMS key for s3 bucket encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags_all                           = (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "vaivaswat_manu"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "appstack"  = "hellokitty"
          + "component" = "hello-kitty"
        }
      + tags_all                    = {
          + "appstack"  = "hellokitty"
          + "component" = "hello-kitty"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_policy.website_bucket_policy[0] will be created
  + resource "aws_s3_bucket_policy" "website_bucket_policy" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0] will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0] will be created
  + resource "aws_s3_bucket_versioning" "this" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_website_configuration.this[0] will be created
  + resource "aws_s3_bucket_website_configuration" "this" {
      + bucket           = (known after apply)
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "404.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/vaivaswat_manu"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "appstack"  = "hellokitty"
          + "component" = "hello-kitty"
        }
      + tags_all          = {
          + "appstack"  = "hellokitty"
          + "component" = "hello-kitty"
        }
    }

  # module.appcd_b4034854-e6ca-4929-9b94-537c57da45ac.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "Writer"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "vaivaswat_manu"
    }

  # module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = {
                  + Action    = "sts:AssumeRole"
                  + Effect    = "Allow"
                  + Principal = {
                      + Service = "lambda.amazonaws.com"
                    }
                }
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vaivaswat_manu"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "appstack"  = "hellokitty"
          + "component" = "hello-kitty"
        }
      + tags_all              = {
          + "appstack"  = "hellokitty"
          + "component" = "hello-kitty"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_cloudwatch_log_group_aws_lambda_vaivaswat_manu_arn  = (known after apply)
  + aws_cloudwatch_log_group_aws_lambda_vaivaswat_manu_name = "/aws/lambda/vaivaswat_manu"
  + aws_iam_role_vaivaswat_manu_arn                         = (known after apply)
  + aws_iam_role_vaivaswat_manu_name                        = "vaivaswat_manu"
  + aws_s3_vaivaswat_manu_arn                               = (known after apply)
  + aws_s3_vaivaswat_manu_bucket_name                       = (known after apply)
  + aws_s3_vaivaswat_manu_bucket_website_endpoint           = (known after apply)
  + aws_s3_vaivaswat_manu_kms_arn                           = (known after apply)

```